Automation/PUMA_Python_Robot/PUMA_AUTO/RF_PUMA/PUMA/Libs/PUMA_ParameterAndSettings/configuration.json

{
	"server" : "10.112.20.84",
	"modality" : "['CR', 'CT', 'DR', 'DX', 'IO', 'MG', 'MR', 'NM', 'OT', 'RF', 'US', 'XA']",
	"bodypart" : "['Hand', 'Chest', 'Head', 'Leg', 'Lung', 'Neck']",
	"grender" : "['F', 'M']",
	"notifyserver_exam_body_content" : "<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:car=\"http://carestream.org/\">\n                <soap:Header/>\n                    <soap:Body>\n                        <car:NotifyExamInfo>\n                            <car:exam>\n                                <car:CreateDT>{CreateDT}</car:CreateDT>\n                                <car:UpdateDT>{UpdateDT}</car:UpdateDT>\n                                <car:PatientID>{PatientID}</car:PatientID>\n                                <car:AccessionNumber>{AccessionNumber}</car:AccessionNumber>\n                                <car:StudyInstanceUID>{StudyInstanceUID}</car:StudyInstanceUID>\n                                <car:NameCN>{NameCN}</car:NameCN>\n                                <car:NameEN>{NameEN}</car:NameEN>\n                                <car:Gender>{Gender}</car:Gender>\n                                <car:Birthday>{Birthday}</car:Birthday>\n                                <car:Modality>{Modality}</car:Modality>\n                                <car:ModalityName>{ModalityName}</car:ModalityName>\n                                <car:PatientType>{PatientType}</car:PatientType>\n                                <car:VisitID>{VisitID}</car:VisitID>\n                                <car:RequestID>{RequestID}</car:RequestID>\n                                <car:RequestDepartment>{RequestDepartment}</car:RequestDepartment>\n                                <car:RequestDT>{RequestDT}</car:RequestDT>\n                                <car:RegisterDT>{RegisterDT}</car:RegisterDT>\n                                <car:ExamDT>{ExamDT}</car:ExamDT>\n                                <car:ReportDT>{ReportDT}</car:ReportDT>\n                                <car:SubmitDT>{SubmitDT}</car:SubmitDT>\n                                <car:ApproveDT>{ApproveDT}</car:ApproveDT>\n                                <car:PDFReportURL>{PDFReportURL}</car:PDFReportURL>\n                                <car:StudyStatus>{StudyStatus}</car:StudyStatus>\n                                <car:OutHospitalNo>{OutHospitalNo}</car:OutHospitalNo>\n                                <car:InHospitalNo>{InHospitalNo}</car:InHospitalNo>\n                                <car:PhysicalNumber>{PhysicalNumber}</car:PhysicalNumber>\n                                <car:ExamName>{ExamName}</car:ExamName>\n                                <car:ExamBodyPart>{ExamBodyPart}</car:ExamBodyPart>\n                                <car:Optional0>{Optional0}</car:Optional0>\n                                <car:Optional1>{Optional1}</car:Optional1>\n                                <car:Optional2>{Optional2}</car:Optional2>\n                                <car:Optional3>{Optional2}</car:Optional3>\n                                <car:Optional4>{Optional4}</car:Optional4>\n                                <car:Optional5>{Optional5}</car:Optional5>\n                                <car:Optional6>{Optional6}</car:Optional6>\n                                <car:Optional7>{Optional7}</car:Optional7>\n                                <car:Optional8>{Optional8}</car:Optional8>\n                                <car:Optional9>{Optional9}</car:Optional9>\n                            </car:exam>\n                        </car:NotifyExamInfo>\n                    </soap:Body>\n                </soap:Envelope>",

	"db_driver" : "{SQL Server}",
	"db_server" : "10.112.20.84\\GCPACSWS",
	"db_default_database" : "WGGC",
	"db_uid" : "sa",
	"db_pwd" : "sa20021224$",
	"db_connectString" : "DRIVER={SQL Server}; SERVER=10.112.20.84\\GCPACSWS;DATABASE=wggc; UID=sa;PWD=sa20021224$",

	"watermark_path" : "D:\\PUMA_AUTO\\RF_PUMA\\PUMA\\Tool\\WaterMark",
	"report_template_file" : "D:\\PUMA_AUTO\\RF_PUMA\\PUMA\\Libs\\PUMA_ReportLibrary\\ReportSample\\Template.txt",
	"report_file" : "D:\\PUMA_AUTO\\RF_PUMA\\PUMA\\Libs\\PUMA_ReportLibrary\\ReportSample\\Report.txt",
	"pdf_report_folder" : "D:\\PUMA_AUTO\\RF_PUMA\\PUMA\\Libs\\PUMA_ReportLibrary\\ReportSample\\",
	"PS_report_shared_folder" : "\\\\{server}\\Report\\Received",
	"report_powershell_path" : "D:\\PUMA_AUTO\\RF_PUMA\\PUMA\\Libs\\PUMA_ReportLibrary\\PowerShellScripts",
	"report_default_printer" : "PDFCreator",

	"EHDPS_status_url" : "/EHDPS/status",
	"EHDPS_printtask_create_url" : "/EHDPS/printtask/create",
	"EHDPS_printtask_print_url" : "/EHDPS/printtask/print/",
	"EHDPS_printtask_report_getinfo_url" : "/EHDPS/printtask/items",
	"EHDPS_printtask_report_print_url" : "/EHDPS/printtask/report/",
	"EHDPS_printtask_status_url" : "/EHDPS/printtask/status/",
	"EHDPS_printtask_status_dict" : "{'-1':'Initialize', '0':'Prepare', '1':'Printing', '2':'Reject', '3':'Error', '4':'Printed', '5':'Pending'}",
	"EHDUS_upload_report_upload_url" : "http://{ip}/ehdus/upload/printer/report/info",
	"Printmode_dict_mode_value" : "{'both':'0', 'film':'1', 'report':'2', 'any':'3', 'not':'5'}",
	"Printmode_dict_value_mode" : "{'0':'both', '1':'film', '2':'report', '3':'any', '5':'not'}",
	"Integration_URL": "http://{server}/KIOSK.Integration/WSProxy.asmx?wsdl",
	"Notify_URL": "http://{server}/NotifyServer/NotifyService.asmx?wsdl",
	"PrintService_URL": "http://{server}/PrintServer/PrintService.asmx?wsdl",
	"HoldTime_dict_mode_value" : "{'on':'1', 'off':'0'}",
	"HoldTime_dict_value_mode" : "{'1':'on', '0':'off'}",
	"Reportstatus_mode_value" : "{'not ready': '0', 'temporary': '1', 'formal': '2'}",
	"Reportstatus_value_mode" : "{'0': 'not ready', '1': 'temporary', '2': 'formal'}",

	"Platform_URL" : "http://{server}/Platform/",
	"Platform_webapi_worklist_searchWorklist_url" : "http://{server}/webapi/api/worklist/searchWorklist",
	"Platform_webapi_worklist_searchWorklist_string_B3100" : "{\"isFuzzy\":\"\",\"patientName\":null,\"patientID\":null,\"accessionNumber\":null,\"createDateRange\":{\"startTime\":null,\"endTime\":null},\"shortcutDateRange\":\"\",\"patientSex\":\"\",\"reportStatus\":\"\",\"reportPrintStatus\":\"\",\"filmPrintStatus\":\"\",\"printMode\":\"\",\"modalityType\":\"\",\"patientType\":\"\",\"department\":\"\",\"completeStatus\":null,\"pagination\":{\"pageIndex\":1,\"pageSize\":20},\"workListOrderBy\":\"\",\"ExamName\":\"\",\"CallingAE\":\"\"}",
	"Platform_webapi_worklist_searchWorklist_string" : "{\"isFuzzy\":\"\",\"patientName\":null,\"patientID\":null,\"accessionNumber\":null,\"createDateRange\":{\"startTime\":null,\"endTime\":null},\"shortcutDateRange\":0,\"patientSex\":\"\",\"reportStatus\":\"\",\"filmStatus\":\"\",\"reportPrintStatus\":\"\",\"filmPrintStatus\":\"\",\"printMode\":\"\",\"modalityType\":\"\",\"patientType\":\"\",\"hospitalDistrict\":\"\",\"department\":\"\",\"completeStatus\":null,\"pagination\":{\"pageIndex\":1,\"pageSize\":20},\"workListOrderBy\":\"\",\"examName\":\"\",\"callingAE\":\"\",\"memoStatus\":\"\"}",
	"Platform_webapi_worklist_searchWorklist_fuzzy_string" : "[\"accessionNumber\", \"patientID\", \"patientName\", \"examName\", \"callingAE\"]",
	"Platform_webapi_worklist_saveShortcut" : "http://{server}/webapi/api/worklist/saveShortcut",
	"Platform_webapi_worklist_shortcut_API_string": "{\"UserName\":\"\",\"RoleName\":\"\",\"Criteria\":{\"isFuzzy\":\"\",\"patientName\":null,\"patientID\":null,\"accessionNumber\":null,\"createDateRange\":{\"startTime\":null,\"endTime\":null},\"shortcutDateRange\":\"\",\"patientSex\":\"\",\"reportStatus\":\"\",\"reportPrintStatus\":\"\",\"filmPrintStatus\":\"\",\"printMode\":\"\",\"modalityType\":\"\",\"patientType\":\"\",\"department\":\"\",\"completeStatus\":null,\"shortcutName\":\"\",\"workListOrderBy\":\"\",\"ExamName\":\"\",\"CallingAE\":\"\",\"shortcutNameCache\":\"\"}}",
	"Platform_webapi_worklist_delete_shortcut_url": "http://{server}/webapi/api/worklist/deleteShortcut",
	"Platform_webapi_worklist_delete_shortcut_bodystring":"{\"UserName\":\"\",\"RoleName\":\"\",\"ShortcutName\":\"\"}",
	"Platform_webapi_worklist_searchWorklist_shortcut_string" : "{\"isFuzzy\":\"\",\"patientName\":null,\"patientID\":null,\"accessionNumber\":null,\"createDateRange\":{\"startTime\":null,\"endTime\":null},\"shortcutDateRange\":\"\",\"patientSex\":\"\",\"reportStatus\":\"\",\"reportPrintStatus\":\"\",\"filmPrintStatus\":\"\",\"printMode\":\"\",\"modalityType\":\"\",\"patientType\":\"\",\"department\":\"\",\"completeStatus\":null,\"pagination\":{\"pageIndex\":1,\"pageSize\":20},\"workListOrderBy\":\"\"}",
	"Platform_webapi_worklist_filmsinfo_accn_url": "http://{server}/webapi/api/worklist/filmInfo?accessionNumber=",
	"Platform_webapi_worklist_centralPrint_url" : "http://{server}/webapi/api/worklist/centralPrint",
	"Platform_webapi_worklist_centralPrint_body_string" : "{\"TerminalId\":\"\",\"UserId\":\"\",\"AccessionNumbers\":[],\"RestInstanceIds\":[]}",
	"Platform_webapi_worklist_printEstimateTime_url": "http://{server}/webapi/api/worklist/printEstimateTime/",
	"Platform_webapi_worklist_printstatus_url": "http://{server}/webapi/api/worklist/printStatus/",

	"Platform_account_check_loginStatus_url": "http://{server}/Platform/Account/CheckLoginStatus",


	"Serverlib_powershell_scripts_path" : "D:\\PUMA_AUTO\\RF_PUMA\\PUMA\\Libs\\PUMA_ServerLibrary\\powershell"
}